Ex3/stepped-channel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	"top.|bottom."
    {
        type            noSlip;
    }
    
    left3
    {
        type            noSlip;
    }
    
    // fix volumetric flow with 1 in x direction
    inlet1
    {
        type            fixedValue;
        value			uniform (1 0 0);
    }
    
    "outlet."
    {
        type            zeroGradient;
    }

    "frontAndBack."
    {
        type            empty;
    }
}

// ************************************************************************* //
