Ex3/stepped-channel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "top.|bottom."
    {
        type            zeroGradient;
    }
    
    left3
    {
        type            zeroGradient;
    }
    
    // continuity defined over volumetric flow
    inlet1
    {
        type            zeroGradient;
    }
    
    "outlet."
    {
        type            fixedValue;
        value			uniform 0;
    }

    "frontAndBack."
    {
        type            empty;
    }
}

// ************************************************************************* //
